function Tz=Depth_Controller(u) % 深度控制器，采用反馈线性化方法
%% 当前深度z，垂向速度w，目标深度zd赋值
z=u(1);
w=u(2);
zd=u(3);

%% 控制器所需相关参数赋值
m=128;
Zwdot=-147.58;
Zw=-4.4132;
Zww=-327.2375;

%% 极点配置法：反馈矩阵K计算（由最终闭环反馈系统的期望极点s1,s2决定）
% s1 = -0.01;
% s2 = -0.01;
% k1=s1*s2;
% k2=-(s1+s2);
% K=[k1 k2];

%% LQR控制法：反馈矩阵K计算（由Q,R矩阵的选取决定）
A=[0 1;0 0];
B=[0;1];
Q=[0.48 0;  %对深度z的累计误差的惩罚
   0 1000]; %对速度w的累计误差的惩罚
R=10^5;     %对控制v(Tz)消耗能量的惩罚
K=lqr(A,B,Q,R);

%% 反馈线性化控制器设计
a=m-Zwdot;
bw=Zw+Zww*abs(w);
v=-K*[z-zd;w]; % 参考输入v=-K*x
Tz=-bw*w+a*v;
end